[
  {
    "type": "Sword",
    "weaponQuality": [
      "The hilt is perfectly balanced, and when held on one’s fingers, it always points North.",
      "The blade is freezing to the touch, and anyone it strikes will feel that cold agony.",
      "The wielder of this sword can will it to glow. It emanates a light similar to that of a torch.",
      "The blade is incorporeal, only emerging from the hilt when the wielder speaks the appropriate words.",
      "The blade can be easily concealed, breaking down into a palm-sized hunk of steel.",
      "The wielder of the blade is able to discern the weakness of anyone they draw blood from.",
      "The wielder of the sword can never be disarmed – the blade refuses to leave their hand unless the wielder wills it.",
      "The sword can scratch glowing runes onto any surface. The runes persist for two days before fading away.",
      "The blade glows bright blue when goblinoids are nearby.",
      "The blade is forged of starsteel, and when exposed to starlight, glows white and deals additional force damage."
    ],
    "physicalFeature": [
      "This blade’s edge is serrated.",
      "Scratched into the weapon’s surface are the names of the lives it has taken.",
      "This sword’s pommel is the skeletal fist of an orc.",
      "This entire sword is a black hue, blade and all.",
      "The crossguard on this sword is shaped like a ten-pointed sun, the edges of which are sharpened",
      "A razor-sharp dagger emerges from the pommel of this weapon.",
      "This double-bladed sword has a grip in its center, and from either end of it protrudes two razor sharp blades.",
      "The blade of this weapon is a matte crimson color.",
      "This sword’s blade is carved from a mystical, green crystal. It gives off a dim, haunting glow.",
      "This weapon has been crafted out of petrified wood.",
      "This sword works like a massive switchblade. At the flick of a switch, the blade telescopes out of its lengthened handle.",
      "This sword looks like a long cleaver, with an elongated axe head stretching out from the hilt.",
      "The handle of this sword is a carved figurine of an ancient hero.",
      "The crossguard of this sword is a soaring eagle. The blade emerges from its opened, upturned beak",
      "There is no handle or hilt on this sword. Instead, the lower third of the blade is wrapped in fine, azure leather.",
      "The blade of this sword is crafted from the canine of a massive sea monster. Some of the blackened roots of the tooth are still attached, forming the wrap for the handle.",
      "Scrap metal from an old, ironclad ship serves as the blade for this sword.",
      "The tip of this sword is forked, tapering into a wicked hook.",
      "Notches and fullers in the sword hum and sing as the blade swings.",
      "Blood cannot be cleaned from this blade – it permanently stains the steel"
    ],
    "descriptorName": [
      "Razor",
      "Blade",
      "Cutter",
      "Slicer",
      "Edge",
      "Biter",
      "Brand",
      "Foil",
      "Saber",
      "Steel",
      "Gutter",
      "Unmaker"
    ]
  },
  {
    "type": "Rapier",
    "weaponQuality": [
      "This is a duelist’s sword. Drawing a line in the sand with it grants the wielder advantage on their next Charisma check.",
      "This rapier’s blade can be made malleable and whiplike at will. The wielder can treat it as a rapier or a whip.",
      "This rapier is imbued with the will of its previous owner. If the wielder is insulted, the rapier cannot be sheathed until it has drawn blood.",
      "This rapier erupts in red flames if blood touches the blade.",
      "This rapier shines with a pure, white light if undead are nearby.",
      "This rapier can be bent and thrown like a boomerang – it returns to the wielder on their next turn and reverts to its original shape.",
      "This keen rapier has a knack for slipping between the plates of armor, bypassing any damage resistance to piercing weapons.",
      "This is a sword cane, and can be easily concealed within its scabbard, appearing as a mundane walking stick.",
      "The wicked notches on this rapier create jagged wounds that will not stitch. Only magical healing will mend these gashes.",
      "This unique rapier features hooked blades on its guard, granting the wielder advantage on disarm attempts."
    ],
    "physicalFeature": [
      "This blade is engraved with an elven poem, eloquently satirizing the follies of war.",
      "With its golden hilt and official engravings, this rapier obviously belonged to a high admiral in the fleet before it fell into your hands.",
      "The knucklebones of a thief dangle from the pommel of this weapon.",
      "The silver guard of this fine rapier depicts a strange creature – a mixture of dragon and lion.",
      "The blade’s swirling damascus pattern contains a dozen kinds of metal, both mundane and magical.",
      "Gold and silver coins were melted down in the forging of this rapier, and their silhouettes can still be discerned in the shiny blade.",
      "Four names are etched into the rapier’s edge – the former owners, who all died holding the weapon.",
      "This rapier is a strange dwarven design – the blade is broad and flat, but flexible and deadly.",
      "This elven rapier is steeply curved, and the blade is honed to a hair’s edge.",
      "This rapier has a barbed tip, designed to inflict as much pain as possible.",
      "This once-fine rapier was defaced by its goblin owner – the hilt is wrapped in human skin, and the blade has been roughly notched with a dozen kills.",
      "This rapier appears to be made of crystal. Its iridescent blade sparkles and shines.",
      "Engraved on the pommel of this simple weapon is a message: “To my darling wife – may this blade protect you in your darkest hour.”",
      "The scabbard of this rapier is made of blood-red wyrmscale.",
      "This rapier is carved from the scythe-like forearm blades of some great jungle cat.",
      "This blade is tinged purple, and seems to shimmer in the light – learned individuals would know it is a weapon touched by the Far Planes.",
      "This rapier is etched with vines, and its pommel is shaped like a leaf.",
      "This rapier appears old and rusted – but it’s still as sharp and sturdy as the day it was forged.",
      "The blade of this weapon is black, yet the hilt and pommel are a white pearl.",
      "This rapier rings softly under the light of the full moon."
    ],
    "descriptorName":  [
      "Song",
      "Cutlass",
      "Slip",
      "Needle",
      "Saber",
      "Hope",
      "Piercer",
      "Seeker",
      "Misery",
      "Promise",
      "Streak",
      "Skewer"
    ]
  },
  {
    "type": "Axe",
    "weaponQuality": [
      "This axe dangles from a heavy, magical chain. If thrown, it can be pulled back to its wielder with a flick of the chain.",
      "This axe is designed for boarding ships. It grants advantage on any checks made to climb wooden surfaces.",
      "On the wielder’s command, this axe drips with a caustic, green liquid, and deals acid damage to enemies.",
      "This axe begins to hum if fiends are nearby. As the fiends draw closer, ancient words of warding emanate from the weapon, granting advantage on your first attack against them.",
      "This large battleaxe is as light as air. It can be wielded as a finesse weapon as though it were a handaxe.",
      "This battleaxe deals additional slashing damage to foes of orcish blood.",
      "This magicked axe will deliver a painful shock to any wielder not attuned to it.",
      "The elongated beard of this axe is designed to catch weapons – it grants advantage on checks made to disarm opponents.",
      "This axe manipulates shadows like silk – as an action, the wielder can cloak himself in darkness and gain advantage on Stealth checks.",
      "This ice-bladed axe reduces the movement speed of creatures it strikes."
    ],
    "physicalFeature": [
      "This rustic axe looks more like a giant meat cleaver, complete with a flat, broad blade and a stout wooden handle.",
      "The handle of this axe is a rigid spinal column, and the head is a monstrous, jagged skull.",
      "The blade of this axe is forged to resemble the face and beard of an ancient dwarven king.",
      "Ten golden rings dangle from the handle of this axe – the rings of a long-dead pirate king.",
      "Flames have been engraved into the blade of this massive axe.",
      "This axe is coal-black.",
      "This axe appears to be made of smoky, black crystal – in fact, it is shaped from the bones of abyssal fiends",
      "This simple lumber axe is etched with a message: “To my son – may your hearth never grow cold.”",
      "This handaxe of stone and wood is scrawled with a barely discernible message: “Dis Grug’s axe. Nobody touch but Grug.”",
      "This axe is trimmed with gold and silver, and a large, fiery ruby inlays the blade.",
      "The serrated edge of this axe is capped with the yellowed, dagger-like teeth of a behir.",
      "This golden axe is of elven design. The head is forged in the shape of an eagle’s wing.",
      "The head of this merchant’s axe may be simple, but the handle is wrapped in expensive leathers. It is quite comfortable to wield.",
      "This axe is made entirely out of stone. Once a symbolic item as part of a statue, it has now been sharpened and put to more use.",
      "The broad head of this axe has a metallic pattern of symbols and lines. It seems to be the genealogical line of a dwarven family.",
      "The head of this axe is flecked with barnacles, and the handwrap is damp and smells of the briny sea.",
      "This axe’s head is crafted entirely of black obsidian.",
      "The shape and proportions of this axe tell you it was once the handaxe of a giant.",
      "The blade of this axe is a block of clear blue ice that sweats but never melts.",
      "A map of the known world is inlayed flawlessly into the blade of this axe."
    ],
    "descriptorName":  [
      "Cleaver",
      "Splitter",
      "Chopper",
      "Reaver",
      "Saber",
      "Hunter",
      "Slayer",
      "Guard",
      "Tooth",
      "Eater",
      "Catcher",
      "Boon"
    ]
  },
  {
    "type": "Hammer/Maul",
    "weaponQuality": [
      "This hammer is particularly adept at breaking bones, and reduces the target’s movement speed on critical hits.",
      "This weapon reacts to nearby gold pieces, giving off a shimmering aura when more than 100 gold coins are near.",
      "This weapon is oddly comfortable to rest your head upon when you sleep. You only need four hours of sleep to feel completely rested.",
      "This weapon, when striking, emits loud, bellowing musical tones of various pitches, making a melody. It deals thunder damage as well as bludgeoning.",
      "This weapon will return to the wielder if thrown, but only if the strike misses its initial target.",
      "This weapon is adorned with the teeth of liars who were executed. When wielding it, you gain an odd confidence, and advantage on checks made to bluff or deceive.",
      "In the darkness, this weapon grants the wielder darkvision up to 20 feet, and makes them more difficult to perceive.",
      "This weapon was built with a cursed keystone, and does additional damage to structures.",
      "This weapon is a lot lighter than it looks. It floats in any liquid.",
      "The deeply scored head of this maul is made to crush and mangle metal. This weapon deals additional damage to constructs."
    ],
    "physicalFeature": [
      "The head of this massive maul is literally just an unshaped stone strapped to a wooden haft.",
      "This marbled, stone hammer glimmers with flakes of precious minerals.",
      "This warhammer appears to be constructed of dozens of swords and daggers, welded together and shaped into a single, wicked weapon.",
      "The wood grain of this immense maul has been dyed in blood.",
      "This stone hammer is inscribed with a runic language you do not recognize.",
      "A holy symbol of the goddess of light is tied with twine just below where the haft meets the head.",
      "The shaft of this maul is wrought iron and the head is carefully hewn marble.",
      "This hammer is quite plain, with a head shaped like that of a blacksmith’s tool, but its size is telling. The blacksmith in question was a giant.",
      "The emblem on the head of this hammer looks like a faded rose, surrounded by a ring of thorns.",
      "The head of this hammer is a jagged blue gemstone.",
      "This massive hammer is etched with symbols that shift and glow like magma.",
      "The handle of this hammer is wrapped with the coarse, golden fur of a mountain cat.",
      "This warhammer is adorned with the antlers of a great stag, and the haft is wrapped with its velvet hide.",
      "Blessed by priests of the spider, the arachnid carvings on this hammer seem to crawl across its surface.",
      "This hammer is inlaid with intricate engravings of flora. The more the weapon is used, the more these designs begin to appear on the wielder’s skin.",
      "The bottom of this maul’s handle is sharpened to a fine point.",
      "The head of this maul is the head of a desecrated statue. Some long-forgotten king...",
      "The mummified arm of a dead warrior makes up this wretched maul. His gauntlet serves as its head.",
      "The stone head of this maul is wrapped in a vicious wire of barbed metal.",
      "This iron club once served as a racquet for a regional team sport, before it found a new purpose in combat."
    ],
    "descriptorName":  [
      "Smasher",
      "Crusher",
      "Lullaby",
      "Throng",
      "Press",
      "Grinder",
      "Ender",
      "Promise",
      "Bruiser",
      "Harvest",
      "Draught",
      "Bane"
    ]
  },
  {
    "type": "Bow",
    "weaponQuality": [
      "Blades protrude from this bow, allowing it to be used as a melee weapon in a pinch.",
      "Arrows nocked to this bow immediately burst into flames, and deal fire damage on hit.",
      "Instead of arrows, this bow looses bolts of lightning.",
      "This bow, when nocked, has a slight pull as if magnetically telling you where danger lies and directing you to hidden enemies.",
      "Two arrows can be drawn and fired at once from this mighty weapon.",
      "Spectral arrows manifest themselves when the bow is drawn – the wielder need not carry arrows, nor worry about an empty quiver.",
      "Arrows from this weapon drip glowing, liquid light, allowing creatures struck by them to be easily tracked.",
      "When the archer wills it, the string on this bow becomes as bright and hot as the sun itself.",
      "While this bow is drawn, water drips from the arrowhead whenever it is pointed toward a body of fresh water.",
      "This weapon’s spectral glow acts as an aiming device, showing you the best possible shot. If you line up the bow within the glowing facsimile, your shot will be more accurate."
    ],
    "physicalFeature": [
      "This bone-white bow is carved from the tusk of a mastodon.",
      "The string of this bow is woven hag’s hair, black and oily.",
      "An inscription down the length of this weapon reads: “May I never draw back on those undeserving.”",
      "This composite bow is constructed of a dozen different woods from across the realm. It was built to celebrate a historic alliance between a dozen kingdoms.",
      "This bow whispers the names of its victims the moment after they are felled.",
      "This bow is made of driftwood, and is emblazoned with the emblem of a lost port city.",
      "The draw on this bow is almost effortless.",
      "The wood that makes up this weapon is still living. Flowers or bits of root periodically grow from it.",
      "This charred bow is made from the wood of a tree downed by fire.",
      "There is no visible string on this bow – instead, a thread of gossamer light appears when an arrow is nocked.",
      "This elven bow is capped with feathered wings of sculpted gold.",
      "Infernal runes along the curve of this bow glow red-hot when an arrow is nocked.",
      "This bow is crafted from the rib of an enormous fish.",
      "A spyglass has been affixed to the side of this sniper’s bow.",
      "This bow has a strange piece of copper embedded within the dark tawny wood. You can sense that it longs for blood.",
      "This bow is from a distant island, and its surface looks like a moving landscape of stone, sand, and water, but feels smooth to the touch.",
      "This bow contains advanced pulleys on either arm, allowing for an easy draw.",
      "This organic bow is crafted from the largest bone of a powerful demon, the string a knotted sinew of the same creature.",
      "An archer can slip their hand into a small glove that hangs from the string of this bow, allowing them access to a hair trigger.",
      "This bow is pure white and glistening. A strange face can be seen within the grain of the wood, and it seems to change expressions from time to time."
    ],
    "descriptorName":  [
      "Sight",
      "Shot",
      "Aim",
      "Strike",
      "Wind",
      "Flight",
      "Seeker",
      "Whisper",
      "Conscience",
      "Curve",
      "Vision",
      "Vengeance"
    ]
  },
  {
    "type": "Crossbow",
    "weaponQuality": [
      "This repeating crossbow can fire three shots without being reloaded.",
      "The ironsights and long barrel on this crossbow extend its effective range by 50 percent.",
      "The bolts fired from this bow are blessed with an arcane eye, allowing the wielder to see from their perspective after they’ve been fired.",
      "The bowstring on this weapon can be quickly dismantled for use as a garrote when ammunition runs dry.",
      "This crossbow doesn’t use traditional ammunition, but fires arcane bolts that generate at the rate it would normally be reloaded. The wielder doesn’t need to carry bolts.",
      "This crossbow has a winch attached, and can be used to fire a grappling hook securely for repelling.",
      "This crossbow has a knack for finding a creature’s heart with its arrows … wherever that heart may be.",
      "The wielder of this crossbow may whisper a secret word to shoot an illusory bolt as a distraction.",
      "This weapon is hard enough to be used as a bludgeoning weapon in a pinch.",
      "The handle of this crossbow contains a full set of thieve’s tools, collapsed and hidden in various ways."
    ],
    "physicalFeature": [
      "The arms of this crossbow are made of yellowed human bones.",
      "This weapon’s pistol grip is made of pure ivory. Only a petty bandit from a vile slum in Merrikor would carry a pearl-handled crossbow…",
      "A beautiful dragon is carved into the dark wood of the stock.",
      "This crossbow is fitted with metal accents in the shape of the battle formations of a fabled army.",
      "The ironsights of this crossbow appear as a blooming flower atop it.",
      "This crossbow is entirely flat black, save for the blood red trigger and drawstring.",
      "This crossbow appears to be partially constructed from an old sword that someone has refitted into a ranged weapon. It’s still sharp...",
      "This crossbow is merely a handle. When the user mimes the action of drawing it back, a weapon of flame and embers appears.",
      "It looks as though this crossbow were folded together out of hundreds of pieces of thick parchment, but it works perfectly.",
      "This crossbow appears different to all who look upon it. Its color and metal adornments are always shaped by the personality of the one who beholds it.",
      "This crossbow is made up of thousands of small pieces of carved wood, interlocked and working together to create a lethal machine.",
      "This crossbow is made of the petrified corpse of a small bat. Its wings serve as the bow’s arms.",
      "This crossbow is said to have been used to murder the ruler of a distant land.",
      "This crossbow was once beautiful, but now is worn down to the unvarnished wood.",
      "This crossbow has a religious verse written on the back of its ironsights, begging forgiveness for the crimes committed while using it.",
      "This crossbow appears to be frozen, though it is warm to the touch.",
      "This crossbow is made of a beautiful crystal, and is almost completely translucent.",
      "Carved into the side of this crossbow is the likeness of the realm’s most renowned villain.",
      "This crossbow has been crafted from one single, solid piece of wood.",
      "This crossbow looks like it was painted into existence using beautiful watercolors. The scene upon it changes every few hours depending the demeanor of the owner."
    ],
    "descriptorName":  [
      "Trigger",
      "Sting",
      "Piercer",
      "Eye",
      "Launcher",
      "Shooter",
      "Bolter",
      "Deluge",
      "Misery",
      "Sigh",
      "Repeater",
      "Striker"
    ]
  },
  {
    "type": "Spear",
    "weaponQuality": [
      "This weapon is lighter than it looks, and allows you to reach further than many other spears.",
      "This weapon splits in the middle at the wielder’s behest, becoming two javelins.",
      "This weapon is equipped with a small buckler. You gain a minor armor bonus when wielding it.",
      "This weapon was forged for slaying dragons, and gives you bonuses to do so if you can find the heart.",
      "This spear is especially long and sharp. If you fell a creature with it, you may attack another creature immediately as it passes through the first target effortlessly.",
      "This spear has more flex than it appears, and can be used as a fulcrum to increase your jumping ability.",
      "This spear is hard enough to pierce through piercing resistances that a creature may have.",
      "This spear is impossibly light. It can be thrown twice the normal distance that a spear normally could be, without penalty.",
      "This spear does additional damage when it is pulled out of a wound due to its splayed barbs.",
      "This spear can tell you a secret of someone whose blood it spills. The more blood, the better the secret."
    ],
    "physicalFeature": [
      "This spear is a waterworn piece of driftwood with an enormous creature’s tooth lashed to it.",
      "This spear has a blade at both ends, one pitch black, one stark white, with its grip the gray of smoke.",
      "This spear has a long, curved blade that is resistant to the staining of blood.",
      "This spear is a field surgeon’s bone saw. It has a jagged, serrated edge that runs half the length of it, with a hempen cord affixed to it for leverage.",
      "This spear appears to be made entirely of water, though it is as hard as steel.",
      "This spear is a single piece of gorgeously shaped and sharpened adamantine, nearly priceless.",
      "The blade of this spear is a flat, sharpened bird of prey, its wings spread viciously, its beak open in a scream. Every part of it is sharp.",
      "This spear is the signature weapon of an evil empire’s honor guard. He who bears it now also bears the responsibilities of the fallen guard who once held it.",
      "This spear was part of a statue in a large city square, but when the city was sacked, it proved to work as well as a real spear.",
      "This elven spear has been marred and mutilated by a lesser creature’s careless upkeep of it.",
      "This spear is a rusted old harpoon from a sunken privateer vessel.",
      "This spear was once the riverboat pry of an underground canal city. The sediment and detritus it collected has been sharpened into a fine, filthy blade.",
      "The spear you are holding has a history of death. It was one of the impaling spikes of a vicious ruler.",
      "This intricate spear has a brass colored framework, filled with cogs and gears.",
      "This spear is made up of gnoll bones, lashed together with gnoll-hide leather. The point protrudes from the mouth of a gnoll skull, frozen forever in a scream.",
      "You call this a spear? It’s an old signpost, sharpened at the end, with the sign still attached. It says “Hands off my Hoard!”",
      "This trident was the ceremonial weapon given to the land-dwelling gladiators in the fighting arena of the submerged cities of this area.",
      "This orcish spear is a relic from a lost tribe. Part of its edge has been broken off, only making it more serrated and vicious.",
      "This weapon has the petrified piece of a dragon’s heart pierced by its razor sharp point. The bottom is black and smells faintly of burnt wood.",
      "This spear was the single weapon that slew the bestial horde’s honor guard in the last great war."
    ],
    "descriptorName":  [
      "Halberd",
      "Spike",
      "Bliss",
      "Curator",
      "Impaler",
      "Javelin",
      "Heart",
      "Polearm",
      "Harpoon",
      "Lance",
      "Trident",
      "Pike"
    ]
  },
  {
    "type": "Dagger",
    "weaponQuality": [
      "When its wielder wills it, this dagger becomes a light source similar to a torch, yet only the bearer can see it. To everyone else, the environment remains dark.",
      "This set of two daggers is extremely magical. The wielder can teleport between the two blades, making knife-throwing an interesting endeavor on the battlefield.",
      "The scabbard of this knife can be unraveled into 30 feet of slender yet durable rope.",
      "This knife is built to break. When an enemy is stabbed by it, its blade may be broken off into their flesh, dealing more damage over time.",
      "This is a magician’s dagger. It can be thrown at any person, yet it always stops before striking them, instead choosing to hover in the air in front of them.",
      "This assassin’s dagger magically changes appearance after dispatching an enemy. It is virtually untrackable.",
      "This dagger is magically weighted for throwing. It does not rotate at all during flight, instead projected more like an arrow, allowing for greater accuracy.",
      "This dagger is sentient, and specializes in memorizing secrets. Even your own...",
      "This weapon has a will of its own. It will often transport its wielder and their companions to any point in the world where an innocent life is in jeopardy.",
      "This dagger is actually a twin of another that has been missing for a decade. It is said that those who carry both can carry a power that is too amazing for any mere mortal’s comprehension."
    ],
    "physicalFeature": [
      "The tip of this dagger contains a small hole with which to insert deadly poisons.",
      "This dagger is pronged at its end, like a tuning fork. It sings when struck against a surface.",
      "A religious symbol has been fused to this dagger’s hilt.",
      "The blade is three-sided and elongated into a sharpened point. Perfect for puncturing.",
      "Two thin blades emerge from the handle of this vicious dagger.",
      "The blade of this dagger is made entirely out of diamond. Its value is phenomenal.",
      "This weapon’s handle contains four loops, allowing it to double as knuckledusters.",
      "This shard of plate armor has been wrapped in multiple cloths for use as a dagger.",
      "This dagger is plated in gold and covered in emeralds and sapphires.",
      "The handle of this knife is two silver serpents, intertwined. The blade emerges from the mouth of one of the snakes.",
      "The handle of this dagger is hollow, allowing for the storage of coins or small vials.",
      "This dagger fits snugly into the closed fist of its wielder, and three blades extend outward like steel claws.",
      "The leather that once covered this handle has rotted off over time, now replaced by a haphazardly-wrapped spool of string.",
      "This dagger’s scabbard is blue in color and contains a clip, specifically built to hold the weapon in one’s boot.",
      "This dagger is actually a broken longsword – its tip is a jagged fragment.",
      "The blade of this dagger has been previously broken. A metal scar exists where it was fused back together.",
      "The blade is beautifully curved in different areas, coming to two different points.",
      "The blade is single-edged and slightly chipped along its sharp blade.",
      "This actually looks like a fine letter opener that has been sharpened into a vicious blade.",
      "This dagger once belonged to a local chef, and is perfect for cutting thick slabs of meat."
    ],
    "descriptorName":  [
      "Syringe",
      "Slicer",
      "Thorn",
      "Kris",
      "Dirk",
      "Cacophony",
      "Monarch",
      "Doom",
      "Switchblade",
      "Slayer",
      "Spine",
      "Skean"
    ]
  },
  {
    "type": "Quarterstaff",
    "weaponQuality": [
      "This staff looks regal, and it allows you to be more successful when trying to convince others that you’re more important than you are. This staff grants advantage on Persuasion checks in social situations.",
      "This staff is an exceptional walking stick, and allows you to traverse the countryside quicker than usual. Using this while traveling allows a normal pace while still allowing the use of stealth.",
      "You can draw streaks of light across the sky with this staff, where they will remain for 1d10 minutes.",
      "Atop this stave is a small glass bulb that lights up with a warm glow when it’s dark.",
      "This staff once belonged to a wizard’s apprentice. It grants advantage on Intelligence checks when trying to recall information.",
      "This staff can be stuck into the ground, and a small covering sprouts from it, creating a shelter big enough for two medium creatures.",
      "This staff tells you which way you are walking by the liquid within it changing colors.",
      "This staff instills into you a desire to seek out power … by any means necessary.",
      "This staff is revitalizing, and will replace a small bit of health for you daily if needed.",
      "When this staff is being used in combat, the wielder can shift time slightly. Once per day, you may reroll a single die roll. You must use the second roll."
    ],
    "physicalFeature": [
      "This quarterstaff is made of pure, white marble.",
      "The wood of this staff is smooth to the touch, after generations of battering skulls.",
      "The surface of this quarterstaff is blue and moves softly like watery ripples.",
      "This staff is made from a broken section of rail tracks. It is weighty and dense.",
      "This quarterstaff is not only a powerful cudgel, but a long wind instrument with various holes and a mouthpiece.",
      "Along the fine wood of this quarterstaff are druidic runes. Closer inspection reveals these symbols to be a calendar, marking out the seasonal holidays.",
      "Clanking wooden wind chimes dangle from this long stave. They clatter pleasingly in the breeze.",
      "A small bundle of drying chili peppers hangs from the top of this staff.",
      "This staff has the names of hundreds of small, mundane objects written upon it in chalk.",
      "This staff is made entirely of large, interlocked ball-bearings made of a dull, dark metal. Perched at the top is a mechanical owl.",
      "This tribal staff is made of a warped branch of a jungle tree.",
      "Atop this dark wooden staff is the shape of a fist, clutching a dagger.",
      "This staff is constructed of solid glass. Its durability is rivalled only by its weight.",
      "This staff is the ossified spine of a large humanoid, topped with most of its skull. The jaw hangs from it by a thick leather strap.",
      "This quarterstaff is crafted to look as though a serpent is wrapped around it, with the head eating a small diamond that floats above its open mouth.",
      "This staff was once the post for a battle standard, its proud military banner now missing.",
      "This staff was crafted from the charred wood of a torched house.",
      "This staff was once part of an altar to a deity, and has an incomplete scripture burned into it.",
      "This staff is long and gnarled, made from a dead tree branch. In its grip is a portion of city rubble, claimed by nature’s grasp.",
      "This meteoric staff is hollow. It sings upon impact with its foes."
    ],
    "descriptorName":  [
      "Pillar",
      "Sepulcher",
      "Ivory",
      "Vanity",
      "Cudgel",
      "Spire",
      "Stave",
      "Finger",
      "Cane",
      "Solitude",
      "Generations",
      "Tears"
    ]
  }
]
